# def f(x):
#     return x*x

# a = f                   # переменная a хранить ссылку на функцию f !!!
# print(f(5))
# print(type(f))
# print(type(a))
# print(a(5))

# -------------------------------------------------------------------

# def calc1(a):
#     return a+a

# def calc2(a):
#     return a*a

# def math(op,x):              
#     print(op(x))

# math(calc1, 5)
# math(calc2, 5)

# -------------------------------------------------------------------

# def calc1(a, b):
#     return a+b

# def calc2(a, b):
#     return a*b

# def calc3(a, b):
#     return a-b

# def math(op,x,y):
#     print(op(x,y))

# math(calc1, 5,6)
# math(calc2, 5,6)
# math(calc3, 5,6)

# -------------------------------------------------------------------

# ТЕМА. lambda-функции
# Сокрашенный вид написания кода


# def calc2(a, b):
#     return a*b

# def math(op,x,y):
#     print(op(x,y))

# # def calc1(a, b):               # эта функция теперь записана короче, смотри строку ниже
# #     return a+b

# # calc1 = lambda a,b: a + b         # фукнция записана в виде lambda функции (вместо строчек 54 и 55)
# # math(calc1, 5,6)                 # вместо calc1 записываем lambda функцию и получаем код в одну строку, см ниже

# math(lambda a,b: a + b, 5,6)


# ЗАДАЧА
# В списке хранятся числа. Нужно выбрать только чётные числа и составить список пар (число; квадрат числа).
# Пример: 1 2 3 5 8 15 23 38
# Получить: [(2, 4), (8, 64), (38, 1444)]


# Решение A. код решени без использования lambda функции
# data = [1, 2, 3, 5, 8, 15, 23, 38]
# res = list()

# for i in data:
#     if i % 2 == 0:
#         res.append((i, i**2))

# print(res)


# Решение B. код с использованием lambda функции
# def select(f, col):                        # эта функция возращает список к каждому элементу которого мы применили функцию f
#     return[f(x) for x in col]

# def where(f, col):                         # эта функция возращает только те значения, которые прошли проверку условием f(x)
#     return[x for x in col if f(x)]

# data = [1, 2, 3, 5, 8, 15, 23, 38]
# res = select(int, data)
# print(res)

# res = where(lambda x: x % 2 ==0, res)
# print(res)

# res = select(lambda x: (x, x**2), res)
# print(res)

# -------------------------------------------------------------------

# ФУНКЦИЯ map
# Функция map() применяет указанную функцию к каждому элементу итерируемого объекта и
# возвращает итератор с новыми объектами.

# list_1 = [x for x in range (1,20)]
# print(list_1)                                     # выводим список до применения фукнции map
# list_1 = list(map(lambda x: x + 10, list_1))
# print(list_1)                                     # выводим список после применения фукнции map

# ЗАДАЧА 1
# C клавиатуры вводится некий набор чисел, в качестве разделителя
# используется пробел. Этот набор чисел будет считан в качестве строки. Как
# превратить list строк в list чисел?

# Маленькое отступление, функция строка.split() - убирает все пробелы и создаем
# список из значений строки, пример:
# data = '1 2 3 5 8 15 23 38'.split()
# print(data) # ['1', '2', '3', '5', '8', '15', '23', '38']

# data = '12 34 567 89 43'
# print(data)

# data = data.split()
# print(data)                    # пример применения функции split

# Решение задачи:

# data = '12 34 567 89 43'
# data = list(map(int, data.split()))
# print(data)


# ЗАДАЧА 2

# def where(f, col):                         # эта функция возращает только те значения, которые прошли проверку условием f(x)
#     return[x for x in col if f(x)]

# data = [1, 2, 3, 5, 8, 15, 23, 38]
# res = map(int, data)
# print(res)

# res = where(lambda x: x % 2 ==0, res)
# print(res)

# res = list(map(lambda x: (x, x**2), res))
# print(res)

# -------------------------------------------------------------------

# ФУНКЦИЯ filter
# Функция filter() применяет указанную функцию к каждому элементу
# итерируемого объекта и возвращает итератор с теми объектами, для которых
# функция вернула True.

# ЗАДАЧА 1
# data = [x for x in range(10)]
# res = list(filter(lambda x: x % 2 == 0, data))
# print(res) # [0, 2, 4, 6, 8]

# ЗАДАЧА 
# Вариант 1 с функцией res
# data = '1 2 3 25 8 15 23 38'.split()
# res = map(int, data)
# res = list(filter(lambda x: x % 10 == 5, res))
# print(res)

# -------------------------------------------------------------------

# ФУНКЦИЯ zip
# Функция zip() применяется к набору итерируемых объектов и
# возвращает итератор с кортежами из элементов входных данных
# Т.е. мы можем с помощью данной функции получить из 3х списков новый список, 
# который будет состоять из первых элемнтов всех трех списков, затем из вторых элементов исходных трех списоков и т.д.
# Например: есть три списка [1,2,3] , ['o','r','t'] , ['f', 'g', 'l']. 
# Функция zip соберет их в список [(1, 'o', 'f'), (2, 'r', 'g'), (3, 't', 'l')]

# users = ['user1', 'user2', 'user3', 'user4', 'user5']
# ids = [4, 5, 9, 14, 7]
# data = list(zip(users, ids))
# print(data)                   # [('user1', 4), ('user2', 5), ('user3', 9), ('user4', 14), ('user5', 7)]

# # Функция zip () пробегает по минимальному входящему набору:
# users = ['user1', 'user2', 'user3', 'user4', 'user5']
# ids = [4, 5, 9, 14, 7]
# salary = [111, 222, 333]
# data = list(zip(users, ids, salary))
# print(data) # [('user1', 4, 111), ('user2', 5, 222), ('user3', 333)]

# -------------------------------------------------------------------

# ФУНКЦИЯ enumerate
#  Функция enumerate() применяется к итерируемому объекту и
# возвращает новый итератор с кортежами из индекса и элементов входных данных.

# Функция enumerate() позволяет пронумеровать набор данных.
# users = ['user1', 'user2', 'user3']
# data = list(enumerate(users))
# print(data) # [(0, 'user1'), (1, 'user2'), (2, 'user3))]

# -------------------------------------------------------------------

# ФАЙЛЫ

# 1. Режим a (режим открытие для добавления данных)
# colors = ['red', '8898', 'blue']
# data = open('file.txt', 'a') # здесь указываем режим, в котором будем работать
# data.writelines(colors) # разделителей не будет
# data.close()                       # используется для закрытия файла

# Ещё один способ записи данных в файл:
# with open('file.txt', 'w') as data:
#     data.write('line 1\n')
#     data.write('line 2\n')
# print(56)


# 2. Режим r (Чтение данных из файла)

# path = 'file.txt'
# data = open(path, 'r')
# for line in data:
#     print(line)
# data.close()

# -------------------------------------------------------------------

# БИБЛИОТЕКИ. Модуль os
# Модуль os предоставляет множество функций для работы с операционной
# системой, причем их поведение, как правило, не зависит от ОС, поэтому программы
# остаются переносимыми.

import os
os.getcwd()

# -------------------------------------------------------------------

# БИБЛИОТЕКИ. Модуль shutil
# Модуль shutil содержит набор функций высокого уровня для обработки файлов,
# групп файлов, и папок. В частности, доступные здесь функции позволяют
# копировать, перемещать и удалять файлы и папки. Часто используется вместе с
# модулем os

import shutil
